/*-----------------------------------------------------------------------------------------------------------*/
/* These strings are used to set the sizes of various UI elements */
firstColumnWidth				= "250";
secondColumnWidth			= "190";

/*-----------------------------------------------------------------------------------------------------------*/
/* These strings set various file system related parameters - They are generally not localizable */
dotMacApplicationName			= "iMovie";
dotMacApplicationID			= "imov";
dotMacPListURL				= "https://configuration.apple.com/configurations/internetservices/iapps/publishConfiguration08.plist";

cameraListURL				= "http://help.apple.com/imovie/cameras";

youTubeMyVideos				= "http://youtube.com/my_videos";
facebookVideos				= "http://www.facebook.com/video/";
vimeoVideos				= "http://www.vimeo.com";
PCPVideos					= "http://www.apple.com/itunes/podcasts/";
CNNVideos					= "http://www.ireport.com/";

projectExtension				= "rcproject";
projectFileName				= "Project";
projectProxyName				= "Proxies";
projectThumbName			= "Thumbnails";
projectStillMovieName			= "Still Images";
projectStillThumbFile			= "Still Thumbnails";
projectQuickLookFile			= "QuickLook/Thumbnail.jpg";
projectMovieFolder			= "Movies";
projectStillFolder				= "Stills";
projectStillName				= "Still %d";
projectSportsFolder			= "Sports";
projectMobileMovie			= "tiny.3gp";
projectSmallMovie				= "mobile.m4v";
projectMediumMovie			= "medium.m4v";
projectLargeMovie				= "large.m4v";
projectHD720Movie			= "720p.mov";
projectHD1080Movie			= "1080p.mov";
dotMacPosterName			= "poster.jpg";
dotMacThumbName			= "web.jpg";
dotMacRefMovieName			= "ref.mov";
dotMacScrubSpriteName			= "scrubSprite.jpg";

moviesFolderPath				= "~/Movies";

soundEffectsPath				= "iMovie Sound Effects";
im08soundEffectsPath			= "iMovie '08 Sound Effects";

iMovieHDMovieFolderSubPath		= "Media";
iMovieHDProjectExtension		= "iMovieProj";

iPhotoPrefsLibraryRootKey		= "iPhotoRecentDatabases";
iPhotoOriginalsFolderName1	= "Originals"; // iPhoto versions thru 2009 (up to 8.1.2)
iPhotoOriginalsFolderName2	= "Masters"; // iPhoto '11 
iPhotoDataFolderName1			= "Data"; // thru 2009
iPhotoDataFolderName2			= "Thumbnails"; // iPhoto '11

iPhotoRollFormat				= "%@ - %@";

aperturePrefsLibraryRootKey		= "ApertureLibraries";
apertureOriginalsFolderName		= "Masters";
apertureDataFolderName			= "iMovie-Thumbnails";

validStillExtensions			= "jpg,jpeg,tif,tiff,png,nef,raw,cr2";
validStillTitleExtensions			= "jpg,jpeg,tif,tiff,png,nef,raw,cr2";
validAudioExtensions			= "mp3,m4a,m4p,aif,aiff,wav,caf";

rangeDataFileName			= "iMovie Data";
thumbnailFolder				= "iMovie Thumbnails";
waveformsPath				= "iMovie Waveforms";
stabilizePath					= "iMovie Stabilization";
audioRateConvertPath			= "iMovie Audio Convert";
stabilizePartial				= "-partial";
stabilizeFull					= "-complete";
iMovieXMLName				= "AlbumData.xml";
ApertureXMLName				= "ApertureData.xml";

captureNamePrefix			= "clip";
captureNameFormat			= "%Y-%m-%d %H;%M;%S";

quickTimeExportPath			= "~/Movies";

quickTimePlayerAppName		= "QuickTime Player";
iTunesAppName				= "iTunes";
iDVDAppName				= "iDVD";

iDVDProjectFormat				= "~/Documents/%@-DVD.dvdproj";

NTSCCountries				= "US,CA,MX,AG,AW,BS,BB,BZ,BM,VG,KY,CR,CU,DM,DO,SV,GT,GD,HT,HN,JM,MS,AN,NI,PA,PR,KN,LC,VC,TT,VI,BO,CL,CO,EC,GY,PY,PE,SR,VE,JP,PH,KR,TW,AS,GU,MP,UM,MH,FM,PW,WS,TO,BR";

invalidEventNameChars			= "/*?.:~";

/* Upgrade Checker */
WebUpgradeServerURL			= "https://configuration.apple.com/configurations/internetservices/imovie/upgrade9.plist";
WebUpgradeILifeName			= "iLife";
WebUpgradeAppName			= "iMovie";

/* Real folder names for Events and Projects - what we create at the UNIX pathname level */
/* these get prettified by the finder - see createLocalizedFolderIfAbsent: */
unixEventFolderName			= "iMovie Events.localized";
unixProjectFolderName			= "iMovie Projects.localized";
unixSpeedConvertedFolderName	= "iMovie Original Movies.localized";
unixDropBoxName				= "iMovie Drop Box.localized";
unixRejectedDropBoxName		= "Unused Drop Box Items.localized";
unixArchivesFolderName			= "iMovie Camera Archives.localized";

iMovieRootFolderName			= "iMovie";
moviesFolderName			= "Movies";
speedConvertedFolderName		= "iMovieSpeedConversion";

desktopFolderPath				= "~/Desktop";

GoogleAddressQuery			= "http://maps.google.com/maps/geo?q=%@&output=xml&key=%@";
